SM_для_EDT/src/InformationRegisters/рарусОчередьОбработкиДублей/рарусОчередьОбработкиДублей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусОчередьОбработкиДублей</name>
  <resources>
    <name>Оригинал</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дубль</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/рарусОчередьОбработкиДублейERP/рарусОчередьОбработкиДублейERP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусОчередьОбработкиДублейERP</name>
  <resources>
    <name>Оригинал</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дубль</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/CommonModules/рарусРегламентныеЗадания/Module.bsl
Процедура ОбработкаДублей() Экспорт
	
	// ++ rarus iljyvs 02.07.2020
	//Очередь обработки дублей. Удалить для включения
	//Возврат;
	// -- rarus iljyvs 02.07.2020
	
	// ++ rarus Камаев П.В. 24.07.2020 Задача № 22963
	ОбработкаДублейERP();
	УстановитьПривилегированныйРежим(Истина);
	// -- rarus Камаев П.В. 24.07.2020
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОбработкиДублей.КодУзла КАК КодУзла,
		|	ОчередьОбработкиДублей.Дубль КАК Дубль,
		|	ОчередьОбработкиДублей.Оригинал КАК Оригинал,
		|	Истина КАК Обработано,
		|	"""" КАК ОшибкаТекст
		|ИЗ
		|	РегистрСведений.рарусОчередьОбработкиДублей КАК ОчередьОбработкиДублей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.Полный КАК Полный
		|		ПО ОчередьОбработкиДублей.КодУзла = Полный.Код
		|			И (Полный.ЭтотУзел)
		|ГДЕ
		|	НЕ ОчередьОбработкиДублей.Обработано";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("ВключатьБизнесЛогику"				, Ложь);
		ПараметрыЗамены.Вставить("УчитыватьПрикладныеПравила"		, Истина);
		ПараметрыЗамены.Вставить("ЗаменаПарыВТранзакции"			, Ложь);
		ПараметрыЗамены.Вставить("СпособУдаления"					, "Пометка");
		
		ДубльОригиналСоответствие = Новый Соответствие;
		ДубльОригиналСоответствие.Вставить(Выборка.Дубль, Выборка.Оригинал);
		
		ОшибкиТаблица = ОбщегоНазначения.ЗаменитьСсылки(ДубльОригиналСоответствие, ПараметрыЗамены);
		
		ЗаписьМенеджер = РегистрыСведений.рарусОчередьОбработкиДублей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьМенеджер, Выборка);
		
		Если ОшибкиТаблица.Количество() Тогда
			ЗаписьМенеджер.ОшибкаТекст = ОшибкиТаблица[0].ТекстОшибки;	
			
		КонецЕсли;
		ЗаписьМенеджер.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// ++ rarus Камаев П.В. 24.07.2020 Задача № 22963
Процедура ОбработкаДублейERP() Экспорт
	
	//Очередь обработки дублей. Удалить для включения
	//Возврат;
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьОбработкиДублей.КодУзла КАК КодУзла,
	|	ОчередьОбработкиДублей.Дубль КАК Дубль,
	|	ОчередьОбработкиДублей.Оригинал КАК Оригинал,
	|	ИСТИНА КАК Обработано,
	|	"""" КАК ОшибкаТекст
	|ИЗ
	|	РегистрСведений.рарусОчередьОбработкиДублейERP КАК ОчередьОбработкиДублей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.рарусОбменУправлениеПредприятиемСудовойМодуль КАК рарусОбменУправлениеПредприятиемСудовойМодуль
	|		ПО ОчередьОбработкиДублей.КодУзла = рарусОбменУправлениеПредприятиемСудовойМодуль.Код
	|			И (рарусОбменУправлениеПредприятиемСудовойМодуль.ЭтотУзел)
	|ГДЕ
	|	НЕ ОчередьОбработкиДублей.Обработано";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыЗамены = Новый Структура;
		ПараметрыЗамены.Вставить("ВключатьБизнесЛогику"				, Ложь);
		ПараметрыЗамены.Вставить("УчитыватьПрикладныеПравила"		, Истина);
		ПараметрыЗамены.Вставить("ЗаменаПарыВТранзакции"			, Ложь);
		ПараметрыЗамены.Вставить("СпособУдаления"					, "Пометка");
		ПараметрыЗамены.Вставить("ДобавитьВОчередьОбработкиДублей"	, Истина);
		
		ДубльОригиналСоответствие = Новый Соответствие;
		ДубльОригиналСоответствие.Вставить(Выборка.Дубль, Выборка.Оригинал);
		
		ОшибкиТаблица = ОбщегоНазначения.ЗаменитьСсылки(ДубльОригиналСоответствие, ПараметрыЗамены);
		
		ЗаписьМенеджер = РегистрыСведений.рарусОчередьОбработкиДублейERP.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьМенеджер, Выборка);
		
		Если ОшибкиТаблица.Количество() Тогда
			ЗаписьМенеджер.ОшибкаТекст = ОшибкиТаблица[0].ТекстОшибки;	
		КонецЕсли;
		ЗаписьМенеджер.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
// -- rarus Камаев П.В. 24.07.2020
